"""Типы данных"""

# Изменяемые тип данных:

# list - список
# set - множество 
# dict - словари

"""
Неозменяемые типы данных

tuple - кортежи
str - строки
bool - логический тип данных(true/false)
int  - цифры
float - дробные числа
complex - комплексные числа,сложные числа
frozenset - неизменяемое множество
NoneType - тип данных для обозначения пустого значения (None)
"""

"""
Переменные
"""
# a = 1
# b = int(1)

# Название переменной не должно начинатьс с цифр или спец символов

# num = 10 # OK
# 1num = 19 0 - Ошбика
# %,$,?,/,!

# Если переменная состоит из нескольких слов, стоит разделять их нижним подчеркиванием

# my_num == 3 # - snake case - свойственно для pyhon
# myNum = 34 # OK - camelCase - свойственно для JS

# my-num = 30 # Error
# my num = 53 # Error

# Название переменных не должно совпадать с названиями ключевых слов

# Регистр в python играет большую роль
# a = 50
# A = 20

# Переменные состоящие из символов верхнего регистра по общему соглашению нельзя изменять(Постоянные/Неизменяемые)

# URL = "google.com"

#Хорошая практика: Называть переменные так, чтобы было понятно, что они в себе хранят

# Литералы - символы использующиеся для обазначения данных

# num = 10
# my_float = 20,3
# string = "sbn"
# list_of_nums = [1, 2, 3]
# tuple_of_nums = (1, 2, 3)
# set_of_nums = {2, 3.4, 5}
# dictinory = {'word': 'слово'}
# nonetype = None
# true = True
# flase = False
"""
Многострочные коментарии
Чаще используется для написания документации к коду
""" 
# Однострочный комментарий - используется для краткого описания строки 
# a = 10 # some comments

"""
Функции print(), input(), type(), id()
"""
# a = "HELLO WORLD"
# print() - функция для вывода информации в терминал
# input() - функция для ввода информации в терминал
# type() - дает тип данных

# Python язык с динамической типизацией и строгой типизацией

# age = int(input("Age: "))
# print('Ваш возраст:',age)

# num = 22
# print(type(num))
# a = 10
# b = 10
# print(id(a))
# print(id(b)) 
print(
    "asdadsads"
    "asdgqwrkg"
)